import re

text = '''
Доля
Ти не лукавила зо мною,
Ти другом, братом і сестрою
Сіромі стала. Ти взяла
Мене, маленького, за руку
І в школу хлопця одвела
До п’яного дяка в науку.
— Учися, серденько, колись
З нас будуть люде, — ти сказала.
А я й послухав, і учивсь,
І вивчився. А ти збрехала.
Які з нас люде? Та дарма!
Ми не лукавили з тобою,
Ми просто йшли; у нас нема
Зерна неправди за собою.
Ходімо ж, доленько моя!
Мій друже вбогий, нелукавий!
Ходімо дальше, дальше слава,
А слава — заповідь моя.
Д
'''


pattern = r"\b([Дд]{1}[а-я]+)"
res = re.findall(pattern, text)
print(res)


# pattern = r'Які з нас люде\?'
# res = re.search(pattern, text)
# print(res.group(), res.start(), res.end()) 


# text1 = '+3809999999'
# text2 = '0999999999'

# pattern = r'\+38(0\d{7})|(0\d{7})'
# res = re.match(pattern, text2)
# print(res is not None)
